Podkova/src/InformationRegisters/СтатистикаСловСловаряСопоставленияНоменклатурыБЭД/СтатистикаСловСловаряСопоставленияНоменклатурыБЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатистикаСловСловаряСопоставленияНоменклатурыБЭД</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Слово</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ТипОбъекта</name>
    <type>
      <types>EnumRef.ТипОбъектаСопоставленияНоменклатурыБЭД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХешСлова</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Podkova/src/Enums/ТипОбъектаСопоставленияНоменклатурыБЭД/ТипОбъектаСопоставленияНоменклатурыБЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипОбъектаСопоставленияНоменклатурыБЭД</name>
  <enumValues>
    <name>Номенклатура</name>
  </enumValues>
  <enumValues>
    <name>Характеристика</name>
  </enumValues>
</mdclass:Enum>

Podkova/src/InformationRegisters/СтатистикаСловСловаряСопоставленияНоменклатурыБЭД/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Обработчик обновления БЭД 1.7.1
//
// Получает из РС.СловарьНоменклатурыХарактеристикиБЭД количество различных слов используемых в словаре и заносит в статистику.
// 
// Параметры:
//  Параметры - Структура из см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Если НЕ ОбновлениеИнформационнойБазы.ОбъектОбработан(Метаданные.РегистрыСведений.СловарьСопоставленияНоменклатурыБЭД.ПолноеИмя()).Обработан Тогда
		Параметры.ОбработкаЗавершена = Ложь;
		Возврат;
	КонецЕсли;
	
	ЕстьОтработанныеЗаписи = Ложь;
	ПроизошлаОшибка        = Ложь;
	ТекстСообщения         = "";
	
	ЗаписатьНаборСловВСтатистикуСловСловаря(Перечисления.ТипОбъектаСопоставленияНоменклатурыБЭД.Номенклатура,
		ЕстьОтработанныеЗаписи, ПроизошлаОшибка, ТекстСообщения);
	ЗаписатьНаборСловВСтатистикуСловСловаря(Перечисления.ТипОбъектаСопоставленияНоменклатурыБЭД.Характеристика,
		ЕстьОтработанныеЗаписи, ПроизошлаОшибка, ТекстСообщения);
	
	Если НЕ ЕстьОтработанныеЗаписи И ПроизошлаОшибка Тогда
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
		
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь,
		Метаданные.РегистрыСведений.СтатистикаСловСловаряСопоставленияНоменклатурыБЭД.ПолноеИмя());
		
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьНаборСловВСтатистикуСловСловаря(Знач ТипОбъекта, ЕстьОтработанныеЗаписи, ПроизошлаОшибка, ТекстСообщения)
	
	Результат = СопоставлениеНоменклатурыКонтрагентовСлужебный.ПолучитьНесоответствияСтатистикиСловИспользованияВСловареСопоставленияНоменклатурыБЭД(ТипОбъекта);
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			
			НаборЗаписейСтатистикиСлов = СопоставлениеНоменклатурыКонтрагентовСлужебный.ЗаполнитьНаборЗаписейСтатистикиСловВСловаре(Выборка, ТипОбъекта);
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейСтатистикиСлов);
			
			ЕстьОтработанныеЗаписи = Истина;
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			
			ШаблонСообщения = НСтр("ru = 'Не удалось обработать запись по слову: %1 по причине:'");
			ТекстСообщения  = СтрШаблон(ШаблонСообщения, Выборка.Слово) + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.РегистрыСведений.СтатистикаСловСловаряСопоставленияНоменклатурыБЭД, , ТекстСообщения);
			
			ПроизошлаОшибка = Истина;
			
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
